---
layout: article
title: "[Dev]Windows Driver(기본)"
key: 20190701
tags:
  - Windows
  - Dev
toc: true
mathjax: true
mathjax_autoNumber: true
published : true
---

# [+] Windows Driver

<!--more-->

후 안티디버깅 기법에도 특허가 있는지 몰랐다. 후킹관련되서 특허가 있다는 것을 확인했다. 좀 웃기기도하다 ㅎㅎㅎ
어쨋든 드라이버 개발쪽도 손을 대는 이유는, 기본원리를 알아야 분석 시작이라도 할 수 있기 때문이다.

최근 게임치트의 경우 드라이버를 이용해 커널영역에서 지지고 볶기 때문이다. 기본적으로 특정 프로세스를 찾는 것과 프로세스 ID를 찾는 드라이버를 구현해본다.

- VMware
- Windows 10(x64) debug mode, testing on
- OSR Loader
- dbgview
- VS2019 Community (SDK 10.0.18362.1, WDK 10.0.18362.1)

## [+] Driver Entry

"Device Driver"의 시작 위치를 의미한다. Main과 같이 Entry Point를 의미함.(C++을 사용하는 경우 extern "C" 를 이용해야 함)

```c
DriverEntry( 
	__in struct _DRIVER_OBJECT  *DriverObject, 
	__in PUNICODE_STRING  RegistryPath 
	)
```

위와 같은 구조로 되어있으며 I/O Manager가 생성한 "DRIVER_OBJECT" 구조체 포인터를 넘겨 받으며 해당 구조체에 기본적인 값들에 대한 초기 설정이 필요하다.

기본적으로 DriverEntry에서 Driver Object를 초기화해주어야 한다.
그래서 UNREFFERENCED_PARAMETER 매크로를 이용한다.

특정 프로세스를 찾으려면 다음과 같은 과정이 필요하다.
PsGetCurrentProcess 를 이용해 _EPROCESS 구조체 포인터를 반환 받는다.
해당 값을 이용하여 프로세스 목록을 가져온다.

```c
VOID Unload(_In_ PDRIVER_OBJECT pDriverObject)
{
	UNREFERENCED_PARAMETER(pDriverObject);
	DbgPrint("Shh0ya Driver Unload\n");
	return;
}

NTSTATUS DriverEntry(
	_In_ PDRIVER_OBJECT pDriverObject,
	_In_ PUNICODE_STRING pRegistryPath
)
{
	UNREFERENCED_PARAMETER(pDriverObject);
	UNREFERENCED_PARAMETER(pRegistryPath);
	
	DbgPrintEx(DPFLTR_IHVDRIVER_ID, DPFLTR_ERROR_LEVEL, "Shh0ya Driver Entry\n");
	DbgPrintEx(DPFLTR_IHVDRIVER_ID,DPFLTR_ERROR_LEVEL,"DriverName : %wZ\n", &pDriverObject->DriverName);
	DbgPrintEx(DPFLTR_IHVDRIVER_ID, DPFLTR_ERROR_LEVEL, "RegistryPath : %wZ\n", pRegistryPath);
	pDriverObject->DriverUnload = Unload;
	return STATUS_SUCCESS;
}
```

기본적으로 위와 같이 사용 가능하다. 물론 아주 기본적인..... 여기서 나와 같이 VMware를 이용해 드라이버 로드 시, `dbgview`에 출력이 안되는 경우가 있다. VMware에서 가로챈다나.... 그래서 위와 같이 `DbgPrintEx`를 사용하면 잘 찍힌다.

이제 프로세스를 찾는 연습을 해보자. 예를 들어 내 드라이버가 특정 프로세스에 관여해야 하는 상황이라는 가정하에...

`EPROCESS`라는 구조체에 대해 알아야 한다.

## [+] EPROCESS 구조체

프로세스가 실행될 때 커널 메모리 내 해당 프로세스 정보를 저장하고 있는 구조체를 생성하는데 이 구조체가 `EPROCESS` 구조체다.

마찬가지로 스레드도 `ETHREAD`라는 구조체를 가진다.

인터널 책에보면 익스큐티브라는 단어가 자주 나오고, MS에서 두루두루 쓰인다.

`EPROCESS`의 `E`가 `Executive`를 의미한다. `PEB`와 약간 비슷한데 `PEB`는 유저모드, `EPROCESS`는 커널모드에서의 프로세스 구조체라고 볼 수 있다.

```
kd> dt nt!_EPROCESS
   +0x000 Pcb              : _KPROCESS
   +0x2d8 ProcessLock      : _EX_PUSH_LOCK
   +0x2e0 UniqueProcessId  : Ptr64 Void			// PID
   +0x2e8 ActiveProcessLinks : _LIST_ENTRY		// Linked List
   +0x2f8 RundownProtect   : _EX_RUNDOWN_REF
   +0x300 Flags2           : Uint4B
   +0x300 JobNotReallyActive : Pos 0, 1 Bit
   +0x300 AccountingFolded : Pos 1, 1 Bit
   +0x300 NewProcessReported : Pos 2, 1 Bit
   +0x300 ExitProcessReported : Pos 3, 1 Bit
   +0x300 ReportCommitChanges : Pos 4, 1 Bit
   +0x300 LastReportMemory : Pos 5, 1 Bit
   +0x300 ForceWakeCharge  : Pos 6, 1 Bit
   +0x300 CrossSessionCreate : Pos 7, 1 Bit
   +0x300 NeedsHandleRundown : Pos 8, 1 Bit
   +0x300 RefTraceEnabled  : Pos 9, 1 Bit
   +0x300 PicoCreated      : Pos 10, 1 Bit
   +0x300 EmptyJobEvaluated : Pos 11, 1 Bit
   +0x300 DefaultPagePriority : Pos 12, 3 Bits
   +0x300 PrimaryTokenFrozen : Pos 15, 1 Bit
   +0x300 ProcessVerifierTarget : Pos 16, 1 Bit
   +0x300 RestrictSetThreadContext : Pos 17, 1 Bit
   +0x300 AffinityPermanent : Pos 18, 1 Bit
   +0x300 AffinityUpdateEnable : Pos 19, 1 Bit
   +0x300 PropagateNode    : Pos 20, 1 Bit
   +0x300 ExplicitAffinity : Pos 21, 1 Bit
   +0x300 ProcessExecutionState : Pos 22, 2 Bits
   +0x300 EnableReadVmLogging : Pos 24, 1 Bit
   +0x300 EnableWriteVmLogging : Pos 25, 1 Bit
   +0x300 FatalAccessTerminationRequested : Pos 26, 1 Bit
   +0x300 DisableSystemAllowedCpuSet : Pos 27, 1 Bit
   +0x300 ProcessStateChangeRequest : Pos 28, 2 Bits
   +0x300 ProcessStateChangeInProgress : Pos 30, 1 Bit
   +0x300 InPrivate        : Pos 31, 1 Bit
   +0x304 Flags            : Uint4B
   +0x304 CreateReported   : Pos 0, 1 Bit
   +0x304 NoDebugInherit   : Pos 1, 1 Bit
   +0x304 ProcessExiting   : Pos 2, 1 Bit
   +0x304 ProcessDelete    : Pos 3, 1 Bit
   +0x304 ManageExecutableMemoryWrites : Pos 4, 1 Bit
   +0x304 VmDeleted        : Pos 5, 1 Bit
   +0x304 OutswapEnabled   : Pos 6, 1 Bit
   +0x304 Outswapped       : Pos 7, 1 Bit
   +0x304 FailFastOnCommitFail : Pos 8, 1 Bit
   +0x304 Wow64VaSpace4Gb  : Pos 9, 1 Bit
   +0x304 AddressSpaceInitialized : Pos 10, 2 Bits
   +0x304 SetTimerResolution : Pos 12, 1 Bit
   +0x304 BreakOnTermination : Pos 13, 1 Bit
   +0x304 DeprioritizeViews : Pos 14, 1 Bit
   +0x304 WriteWatch       : Pos 15, 1 Bit
   +0x304 ProcessInSession : Pos 16, 1 Bit
   +0x304 OverrideAddressSpace : Pos 17, 1 Bit
   +0x304 HasAddressSpace  : Pos 18, 1 Bit
   +0x304 LaunchPrefetched : Pos 19, 1 Bit
   +0x304 Background       : Pos 20, 1 Bit
   +0x304 VmTopDown        : Pos 21, 1 Bit
   +0x304 ImageNotifyDone  : Pos 22, 1 Bit
   +0x304 PdeUpdateNeeded  : Pos 23, 1 Bit
   +0x304 VdmAllowed       : Pos 24, 1 Bit
   +0x304 ProcessRundown   : Pos 25, 1 Bit
   +0x304 ProcessInserted  : Pos 26, 1 Bit
   +0x304 DefaultIoPriority : Pos 27, 3 Bits
   +0x304 ProcessSelfDelete : Pos 30, 1 Bit
   +0x304 SetTimerResolutionLink : Pos 31, 1 Bit
   +0x308 CreateTime       : _LARGE_INTEGER
   +0x310 ProcessQuotaUsage : [2] Uint8B
   +0x320 ProcessQuotaPeak : [2] Uint8B
   +0x330 PeakVirtualSize  : Uint8B
   +0x338 VirtualSize      : Uint8B
   +0x340 SessionProcessLinks : _LIST_ENTRY
   +0x350 ExceptionPortData : Ptr64 Void
   +0x350 ExceptionPortValue : Uint8B
   +0x350 ExceptionPortState : Pos 0, 3 Bits
   +0x358 Token            : _EX_FAST_REF
   +0x360 MmReserved       : Uint8B
   +0x368 AddressCreationLock : _EX_PUSH_LOCK
   +0x370 PageTableCommitmentLock : _EX_PUSH_LOCK
   +0x378 RotateInProgress : Ptr64 _ETHREAD
   +0x380 ForkInProgress   : Ptr64 _ETHREAD
   +0x388 CommitChargeJob  : Ptr64 _EJOB
   +0x390 CloneRoot        : _RTL_AVL_TREE
   +0x398 NumberOfPrivatePages : Uint8B
   +0x3a0 NumberOfLockedPages : Uint8B
   +0x3a8 Win32Process     : Ptr64 Void
   +0x3b0 Job              : Ptr64 _EJOB
   +0x3b8 SectionObject    : Ptr64 Void
   +0x3c0 SectionBaseAddress : Ptr64 Void
   +0x3c8 Cookie           : Uint4B
   +0x3d0 WorkingSetWatch  : Ptr64 _PAGEFAULT_HISTORY
   +0x3d8 Win32WindowStation : Ptr64 Void
   +0x3e0 InheritedFromUniqueProcessId : Ptr64 Void
   +0x3e8 Spare0           : Ptr64 Void
   +0x3f0 OwnerProcessId   : Uint8B
   +0x3f8 Peb              : Ptr64 _PEB
   +0x400 Session          : Ptr64 _MM_SESSION_SPACE
   +0x408 Spare1           : Ptr64 Void
   +0x410 QuotaBlock       : Ptr64 _EPROCESS_QUOTA_BLOCK
   +0x418 ObjectTable      : Ptr64 _HANDLE_TABLE
   +0x420 DebugPort        : Ptr64 Void
   +0x428 WoW64Process     : Ptr64 _EWOW64PROCESS
   +0x430 DeviceMap        : Ptr64 Void
   +0x438 EtwDataSource    : Ptr64 Void
   +0x440 PageDirectoryPte : Uint8B
   +0x448 ImageFilePointer : Ptr64 _FILE_OBJECT
   +0x450 ImageFileName    : [15] UChar				// Process Name
   +0x45f PriorityClass    : UChar
   +0x460 SecurityPort     : Ptr64 Void
   +0x468 SeAuditProcessCreationInfo : _SE_AUDIT_PROCESS_CREATION_INFO
   +0x470 JobLinks         : _LIST_ENTRY
   +0x480 HighestUserAddress : Ptr64 Void
   +0x488 ThreadListHead   : _LIST_ENTRY
   +0x498 ActiveThreads    : Uint4B
   +0x49c ImagePathHash    : Uint4B
   +0x4a0 DefaultHardErrorProcessing : Uint4B
   +0x4a4 LastThreadExitStatus : Int4B
   +0x4a8 PrefetchTrace    : _EX_FAST_REF
   +0x4b0 LockedPagesList  : Ptr64 Void
   +0x4b8 ReadOperationCount : _LARGE_INTEGER
   +0x4c0 WriteOperationCount : _LARGE_INTEGER
   +0x4c8 OtherOperationCount : _LARGE_INTEGER
   +0x4d0 ReadTransferCount : _LARGE_INTEGER
   +0x4d8 WriteTransferCount : _LARGE_INTEGER
   +0x4e0 OtherTransferCount : _LARGE_INTEGER
   +0x4e8 CommitChargeLimit : Uint8B
   +0x4f0 CommitCharge     : Uint8B
   +0x4f8 CommitChargePeak : Uint8B
   +0x500 Vm               : _MMSUPPORT_FULL
   +0x610 MmProcessLinks   : _LIST_ENTRY
   +0x620 ModifiedPageCount : Uint4B
   +0x624 ExitStatus       : Int4B
   +0x628 VadRoot          : _RTL_AVL_TREE
   +0x630 VadHint          : Ptr64 Void
   +0x638 VadCount         : Uint8B
   +0x640 VadPhysicalPages : Uint8B
   +0x648 VadPhysicalPagesLimit : Uint8B
   +0x650 AlpcContext      : _ALPC_PROCESS_CONTEXT
   +0x670 TimerResolutionLink : _LIST_ENTRY
   +0x680 TimerResolutionStackRecord : Ptr64 _PO_DIAG_STACK_RECORD
   +0x688 RequestedTimerResolution : Uint4B
   +0x68c SmallestTimerResolution : Uint4B
   +0x690 ExitTime         : _LARGE_INTEGER
   +0x698 InvertedFunctionTable : Ptr64 _INVERTED_FUNCTION_TABLE
   +0x6a0 InvertedFunctionTableLock : _EX_PUSH_LOCK
   +0x6a8 ActiveThreadsHighWatermark : Uint4B
   +0x6ac LargePrivateVadCount : Uint4B
   +0x6b0 ThreadListLock   : _EX_PUSH_LOCK
   +0x6b8 WnfContext       : Ptr64 Void
   +0x6c0 ServerSilo       : Ptr64 _EJOB
   +0x6c8 SignatureLevel   : UChar
   +0x6c9 SectionSignatureLevel : UChar
   +0x6ca Protection       : _PS_PROTECTION
   +0x6cb HangCount        : Pos 0, 3 Bits
   +0x6cb GhostCount       : Pos 3, 3 Bits
   +0x6cb PrefilterException : Pos 6, 1 Bit
   +0x6cc Flags3           : Uint4B
   +0x6cc Minimal          : Pos 0, 1 Bit
   +0x6cc ReplacingPageRoot : Pos 1, 1 Bit
   +0x6cc Crashed          : Pos 2, 1 Bit
   +0x6cc JobVadsAreTracked : Pos 3, 1 Bit
   +0x6cc VadTrackingDisabled : Pos 4, 1 Bit
   +0x6cc AuxiliaryProcess : Pos 5, 1 Bit
   +0x6cc SubsystemProcess : Pos 6, 1 Bit
   +0x6cc IndirectCpuSets  : Pos 7, 1 Bit
   +0x6cc RelinquishedCommit : Pos 8, 1 Bit
   +0x6cc HighGraphicsPriority : Pos 9, 1 Bit
   +0x6cc CommitFailLogged : Pos 10, 1 Bit
   +0x6cc ReserveFailLogged : Pos 11, 1 Bit
   +0x6cc SystemProcess    : Pos 12, 1 Bit
   +0x6cc HideImageBaseAddresses : Pos 13, 1 Bit
   +0x6cc AddressPolicyFrozen : Pos 14, 1 Bit
   +0x6cc ProcessFirstResume : Pos 15, 1 Bit
   +0x6cc ForegroundExternal : Pos 16, 1 Bit
   +0x6cc ForegroundSystem : Pos 17, 1 Bit
   +0x6cc HighMemoryPriority : Pos 18, 1 Bit
   +0x6cc EnableProcessSuspendResumeLogging : Pos 19, 1 Bit
   +0x6cc EnableThreadSuspendResumeLogging : Pos 20, 1 Bit
   +0x6cc SecurityDomainChanged : Pos 21, 1 Bit
   +0x6cc SecurityFreezeComplete : Pos 22, 1 Bit
   +0x6cc VmProcessorHost  : Pos 23, 1 Bit
   +0x6d0 DeviceAsid       : Int4B
   +0x6d8 SvmData          : Ptr64 Void
   +0x6e0 SvmProcessLock   : _EX_PUSH_LOCK
   +0x6e8 SvmLock          : Uint8B
   +0x6f0 SvmProcessDeviceListHead : _LIST_ENTRY
   +0x700 LastFreezeInterruptTime : Uint8B
   +0x708 DiskCounters     : Ptr64 _PROCESS_DISK_COUNTERS
   +0x710 PicoContext      : Ptr64 Void
   +0x718 EnclaveTable     : Ptr64 Void
   +0x720 EnclaveNumber    : Uint8B
   +0x728 EnclaveLock      : _EX_PUSH_LOCK
   +0x730 HighPriorityFaultsAllowed : Uint4B
   +0x738 EnergyContext    : Ptr64 _PO_PROCESS_ENERGY_CONTEXT
   +0x740 VmContext        : Ptr64 Void
   +0x748 SequenceNumber   : Uint8B
   +0x750 CreateInterruptTime : Uint8B
   +0x758 CreateUnbiasedInterruptTime : Uint8B
   +0x760 TotalUnbiasedFrozenTime : Uint8B
   +0x768 LastAppStateUpdateTime : Uint8B
   +0x770 LastAppStateUptime : Pos 0, 61 Bits
   +0x770 LastAppState     : Pos 61, 3 Bits
   +0x778 SharedCommitCharge : Uint8B
   +0x780 SharedCommitLock : _EX_PUSH_LOCK
   +0x788 SharedCommitLinks : _LIST_ENTRY
   +0x798 AllowedCpuSets   : Uint8B
   +0x7a0 DefaultCpuSets   : Uint8B
   +0x798 AllowedCpuSetsIndirect : Ptr64 Uint8B
   +0x7a0 DefaultCpuSetsIndirect : Ptr64 Uint8B
   +0x7a8 DiskIoAttribution : Ptr64 Void
   +0x7b0 DxgProcess       : Ptr64 Void
   +0x7b8 Win32KFilterSet  : Uint4B
   +0x7c0 ProcessTimerDelay : _PS_INTERLOCKED_TIMER_DELAY_VALUES
   +0x7c8 KTimerSets       : Uint4B
   +0x7cc KTimer2Sets      : Uint4B
   +0x7d0 ThreadTimerSets  : Uint4B
   +0x7d8 VirtualTimerListLock : Uint8B
   +0x7e0 VirtualTimerListHead : _LIST_ENTRY
   +0x7f0 WakeChannel      : _WNF_STATE_NAME
   +0x7f0 WakeInfo         : _PS_PROCESS_WAKE_INFORMATION
   +0x820 MitigationFlags  : Uint4B
   +0x820 MitigationFlagsValues : <unnamed-tag>
   +0x824 MitigationFlags2 : Uint4B
   +0x824 MitigationFlags2Values : <unnamed-tag>
   +0x828 PartitionObject  : Ptr64 Void
   +0x830 SecurityDomain   : Uint8B
   +0x838 ParentSecurityDomain : Uint8B
   +0x840 CoverageSamplerContext : Ptr64 Void
   +0x848 MmHotPatchContext : Ptr64 Void
```

현재 Windows10(x64)의 `EPROCESS` 구조체다. 이 구조체를 이용하여 프로세스 이름, PID를 출력해보겠다.

필요한 구조체는 3가지다. `0x2E0(PID), 0x2E8(구조체 연결 리스트), 0x450(프로세스명)` 을 이용한다.
여기서 우선... `ImageFileName    : [15] UChar` 이걸 짚고 넘어가야 한다. 아직 더 찾아보지도 키워드도 어찌해야할지 몰라 일단 넘어가긴했는데... 사이즈가 15다.. NULL을 포함하면 총 14개의 원소.. 즉 프로세스 명을 출력하면 14글자 이후로 잘리게 된다. 

어찌해야하나요.................?; 아시는 분 답변 좀...

어쨋든 그래서 `strncmp`를 이용하여 내가 원하는 프로세스를 찾기로 했다.

## [+] Example

먼저 프로세스 이름을 출력하는 예제를 만들어봤다.

```c
VOID Unload(_In_ PDRIVER_OBJECT pDriverObject)
{
	UNREFERENCED_PARAMETER(pDriverObject);
	DbgPrint("Shh0ya Driver Unload\n");
	return;
}

NTSTATUS DriverEntry(
	_In_ PDRIVER_OBJECT pDriverObject,
	_In_ PUNICODE_STRING pRegistryPath
)
{
	UNREFERENCED_PARAMETER(pDriverObject);
	UNREFERENCED_PARAMETER(pRegistryPath);
	
	PEPROCESS eProc = (PEPROCESS)PsGetCurrentProcess();
	PLIST_ENTRY pHead, pNode;
	unsigned  char* proc = NULL;
	pHead = pNode = (PLIST_ENTRY)((unsigned  char*)eProc + 0x2E8);	// ActiveProcessLinks
	do {
		proc = (unsigned  char*)((unsigned  char*)pNode - 0x2E8);
		DbgPrintEx(DPFLTR_IHVDRIVER_ID, DPFLTR_ERROR_LEVEL, "[#] Process Name : %s\n", (unsigned  char*)((unsigned  char*)proc + 0x450));	// ImageFileName
		pNode = pNode->Flink;
	} while (pNode->Flink != pHead);
	pDriverObject->DriverUnload = Unload;
	return STATUS_SUCCESS;
}
```

`PLIST_ENTRY` 라는 구조체가 등장한다.

```c
typedef struct _LIST_ENTRY {
   struct _LIST_ENTRY *Flink;
   struct _LIST_ENTRY *Blink;
} LIST_ENTRY, *PLIST_ENTRY;
```

<img src="https://www.osronline.com/images/default/articles/499/Picture13.jpg">

이렇게 연결되어 있다.  do~while 문을 이용한다. MSDN에 보면 LIST_ENTRY Flink(다음 노드)가 존재하지 않으면 Flink는 head를 가리킨다. 그러나... 14바이트만큼만 출력된다 ㅠㅠㅠ..

어쨋든 이 때 `strncmp`를 이용하여 내가 찾는 프로세스를 찾을 수 있긴하다. do ~ while 안에

```c
if (strncmp("Process_Monitor.exe",(const char*)((unsigned char*)proc+0x450),14)==0) {
			DbgPrintEx(DPFLTR_IHVDRIVER_ID,DPFLTR_ERROR_LEVEL,"[#] This Process!\n");
```

요롷게... 해줬더니 잘 찾는다. 이제 PID를 찾는건 간단하다. 해당 프로세스의 EPROCESS 구조체를 가지고 있으니 오프셋만큼만 출력해주면 PID가 출력된다.

전체 소스코드다.

```c
VOID Unload(_In_ PDRIVER_OBJECT pDriverObject)
{
	UNREFERENCED_PARAMETER(pDriverObject);
	DbgPrint("Shh0ya Driver Unload\n");
	return;
}

NTSTATUS DriverEntry(
	_In_ PDRIVER_OBJECT pDriverObject,
	_In_ PUNICODE_STRING pRegistryPath
)
{
	UNREFERENCED_PARAMETER(pDriverObject);
	UNREFERENCED_PARAMETER(pRegistryPath);
	
	DbgPrintEx(DPFLTR_IHVDRIVER_ID, DPFLTR_ERROR_LEVEL, "Shh0ya Driver Entry\n");
	DbgPrintEx(DPFLTR_IHVDRIVER_ID,DPFLTR_ERROR_LEVEL,"DriverName : %wZ\n", &pDriverObject->DriverName);
	DbgPrintEx(DPFLTR_IHVDRIVER_ID, DPFLTR_ERROR_LEVEL, "RegistryPath : %wZ\n", pRegistryPath);
	PEPROCESS eProc = (PEPROCESS)PsGetCurrentProcess();
	PLIST_ENTRY pHead, pNode;
	unsigned  char* proc = NULL;
	pHead = pNode = (PLIST_ENTRY)((unsigned  char*)eProc + 0x2E8);
	do {
		proc = (unsigned  char*)((unsigned  char*)pNode - 0x2E8);
		DbgPrintEx(DPFLTR_IHVDRIVER_ID, DPFLTR_ERROR_LEVEL, "%s\n", (unsigned  char*)((unsigned  char*)proc + 0x450));

		if (strncmp("Process_Monitor.exe",(const char*)((unsigned char*)proc+0x450),14)==0) {
			DbgPrintEx(DPFLTR_IHVDRIVER_ID,DPFLTR_ERROR_LEVEL,"[#] This Process!\n");
			DbgPrintEx(DPFLTR_IHVDRIVER_ID, DPFLTR_ERROR_LEVEL, "[#] PID : %d\n",*(ULONG*)((unsigned char*)proc+0x2e0));
			
		}
		
		pNode = pNode->Flink;
	} while (pNode->Flink != pHead);
	pDriverObject->DriverUnload = Unload;
	return STATUS_SUCCESS;
}
```

잘 출력된다.!!! `EPROCESS` 멤버 중 `0x420`에 `DebugPort`가 있다. 요걸 이용해서 구현좀 해봐야겠다..

끝!



