---
layout: article
title: "[Rev]x64 SSDT&KPCR"
key: 20190603
tags:
  - Reversing
toc: true
mathjax: true
mathjax_autoNumber: true
published : true
---

# [+] Kernel Processor Control Region

<!--more-->

커널 프로세서 제어 영역으로 해당 프로세서의 정보를 가지고 있는 커널 모드 구조체

```
2: kd> dt nt!_KPCR
   +0x000 NtTib            : _NT_TIB
   +0x000 GdtBase          : Ptr64 _KGDTENTRY64
   +0x008 TssBase          : Ptr64 _KTSS64
   +0x010 UserRsp          : Uint8B
   +0x018 Self             : Ptr64 _KPCR
   +0x020 CurrentPrcb      : Ptr64 _KPRCB
   +0x028 LockArray        : Ptr64 _KSPIN_LOCK_QUEUE
   +0x030 Used_Self        : Ptr64 Void
   +0x038 IdtBase          : Ptr64 _KIDTENTRY64
   +0x040 Unused           : [2] Uint8B
   +0x050 Irql             : UChar
   +0x051 SecondLevelCacheAssociativity : UChar
   +0x052 ObsoleteNumber   : UChar
   +0x053 Fill0            : UChar
   +0x054 Unused0          : [3] Uint4B
   +0x060 MajorVersion     : Uint2B
   +0x062 MinorVersion     : Uint2B
   +0x064 StallScaleFactor : Uint4B
   +0x068 Unused1          : [3] Ptr64 Void
   +0x080 KernelReserved   : [15] Uint4B
   +0x0bc SecondLevelCacheSize : Uint4B
   +0x0c0 HalReserved      : [16] Uint4B
   +0x100 Unused2          : Uint4B
   +0x108 KdVersionBlock   : Ptr64 Void
   +0x110 Unused3          : Ptr64 Void
   +0x118 PcrAlign1        : [24] Uint4B
   +0x180 Prcb             : _KPRCB
```

마지막 맴버인 `_KPRCB`는 커널 프로세서 제어 블록 구조체의 위치를 갖기ㅗ 있다. 엄청 크다.

```
2: kd> dt nt!_KPRCB
   +0x000 MxCsr            : Uint4B
   +0x004 LegacyNumber     : UChar
   +0x005 ReservedMustBeZero : UChar
   +0x006 InterruptRequest : UChar
   +0x007 IdleHalt         : UChar
   +0x008 CurrentThread    : Ptr64 _KTHREAD
   +0x010 NextThread       : Ptr64 _KTHREAD
   +0x018 IdleThread       : Ptr64 _KTHREAD
   ...
   +0x7e80 RequestMailbox   : [1] _REQUEST_MAILBOX
```

`0x08` 위치에는 현재 스레드와 다음 스레드 이런식으로 되어있는데.. `_KTHREAD` 역시 구조체다. 스레드에 대한 저수준의 정보를 갖고 있다고 한다.

```
2: kd> dt _KTHREAD
nt!_KTHREAD
   +0x000 Header           : _DISPATCHER_HEADER
   +0x018 SListFaultAddress : Ptr64 Void
   +0x020 QuantumTarget    : Uint8B
   +0x028 InitialStack     : Ptr64 Void
   +0x030 StackLimit       : Ptr64 Void
   +0x038 StackBase        : Ptr64 Void
   +0x040 ThreadLock       : Uint8B
   +0x048 CycleTime        : Uint8B
   +0x050 CurrentRunTime   : Uint4B
   +0x054 ExpectedRunTime  : Uint4B
   +0x058 KernelStack      : Ptr64 Void
   +0x060 StateSaveArea    : Ptr64 _XSAVE_FORMAT
   +0x068 SchedulingGroup  : Ptr64 _KSCHEDULING_GROUP
   +0x070 WaitRegister     : _KWAIT_STATUS_REGISTER
   +0x071 Running          : UChar
   +0x072 Alerted          : [2] UChar
   +0x074 AutoBoostActive  : Pos 0, 1 Bit
   +0x074 ReadyTransition  : Pos 1, 1 Bit
   +0x074 WaitNext         : Pos 2, 1 Bit
   +0x074 SystemAffinityActive : Pos 3, 1 Bit
   +0x074 Alertable        : Pos 4, 1 Bit
   +0x074 UserStackWalkActive : Pos 5, 1 Bit
   +0x074 ApcInterruptRequest : Pos 6, 1 Bit
   +0x074 QuantumEndMigrate : Pos 7, 1 Bit
   +0x074 UmsDirectedSwitchEnable : Pos 8, 1 Bit
   +0x074 TimerActive      : Pos 9, 1 Bit
   +0x074 SystemThread     : Pos 10, 1 Bit
   +0x074 ProcessDetachActive : Pos 11, 1 Bit
   +0x074 CalloutActive    : Pos 12, 1 Bit
   +0x074 ScbReadyQueue    : Pos 13, 1 Bit
   +0x074 ApcQueueable     : Pos 14, 1 Bit
   +0x074 ReservedStackInUse : Pos 15, 1 Bit
   +0x074 UmsPerformingSyscall : Pos 16, 1 Bit
   +0x074 TimerSuspended   : Pos 17, 1 Bit
   +0x074 SuspendedWaitMode : Pos 18, 1 Bit
   +0x074 SuspendSchedulerApcWait : Pos 19, 1 Bit
   +0x074 CetShadowStack   : Pos 20, 1 Bit
   +0x074 Reserved         : Pos 21, 11 Bits
   +0x074 MiscFlags        : Int4B
   +0x078 BamQosLevel      : Pos 0, 2 Bits
   +0x078 AutoAlignment    : Pos 2, 1 Bit
   +0x078 DisableBoost     : Pos 3, 1 Bit
   +0x078 AlertedByThreadId : Pos 4, 1 Bit
   +0x078 QuantumDonation  : Pos 5, 1 Bit
   +0x078 EnableStackSwap  : Pos 6, 1 Bit
   +0x078 GuiThread        : Pos 7, 1 Bit
   +0x078 DisableQuantum   : Pos 8, 1 Bit
   +0x078 ChargeOnlySchedulingGroup : Pos 9, 1 Bit
   +0x078 DeferPreemption  : Pos 10, 1 Bit
   +0x078 QueueDeferPreemption : Pos 11, 1 Bit
   +0x078 ForceDeferSchedule : Pos 12, 1 Bit
   +0x078 SharedReadyQueueAffinity : Pos 13, 1 Bit
   +0x078 FreezeCount      : Pos 14, 1 Bit
   +0x078 TerminationApcRequest : Pos 15, 1 Bit
   +0x078 AutoBoostEntriesExhausted : Pos 16, 1 Bit
   +0x078 KernelStackResident : Pos 17, 1 Bit
   +0x078 TerminateRequestReason : Pos 18, 2 Bits
   +0x078 ProcessStackCountDecremented : Pos 20, 1 Bit
   +0x078 RestrictedGuiThread : Pos 21, 1 Bit
   +0x078 VpBackingThread  : Pos 22, 1 Bit
   +0x078 ThreadFlagsSpare : Pos 23, 1 Bit
   +0x078 EtwStackTraceApcInserted : Pos 24, 8 Bits
   +0x078 ThreadFlags      : Int4B
   +0x07c Tag              : UChar
   +0x07d SystemHeteroCpuPolicy : UChar
   +0x07e UserHeteroCpuPolicy : Pos 0, 7 Bits
   +0x07e ExplicitSystemHeteroCpuPolicy : Pos 7, 1 Bit
   +0x07f RunningNonRetpolineCode : Pos 0, 1 Bit
   +0x07f SpecCtrlSpare    : Pos 1, 7 Bits
   +0x07f SpecCtrl         : UChar
   +0x080 SystemCallNumber : Uint4B
   +0x084 ReadyTime        : Uint4B
   +0x088 FirstArgument    : Ptr64 Void
   +0x090 TrapFrame        : Ptr64 _KTRAP_FRAME
   +0x098 ApcState         : _KAPC_STATE
   +0x098 ApcStateFill     : [43] UChar
   +0x0c3 Priority         : Char
   +0x0c4 UserIdealProcessor : Uint4B
   +0x0c8 WaitStatus       : Int8B
   +0x0d0 WaitBlockList    : Ptr64 _KWAIT_BLOCK
   +0x0d8 WaitListEntry    : _LIST_ENTRY
   +0x0d8 SwapListEntry    : _SINGLE_LIST_ENTRY
   +0x0e8 Queue            : Ptr64 _DISPATCHER_HEADER
   +0x0f0 Teb              : Ptr64 Void
   +0x0f8 RelativeTimerBias : Uint8B
   +0x100 Timer            : _KTIMER
   +0x140 WaitBlock        : [4] _KWAIT_BLOCK
   +0x140 WaitBlockFill4   : [20] UChar
   +0x154 ContextSwitches  : Uint4B
   +0x140 WaitBlockFill5   : [68] UChar
   +0x184 State            : UChar
   +0x185 Spare13          : Char
   +0x186 WaitIrql         : UChar
   +0x187 WaitMode         : Char
   +0x140 WaitBlockFill6   : [116] UChar
   +0x1b4 WaitTime         : Uint4B
   +0x140 WaitBlockFill7   : [164] UChar
   +0x1e4 KernelApcDisable : Int2B
   +0x1e6 SpecialApcDisable : Int2B
   +0x1e4 CombinedApcDisable : Uint4B
   +0x140 WaitBlockFill8   : [40] UChar
   +0x168 ThreadCounters   : Ptr64 _KTHREAD_COUNTERS
   +0x140 WaitBlockFill9   : [88] UChar
   +0x198 XStateSave       : Ptr64 _XSTATE_SAVE
   +0x140 WaitBlockFill10  : [136] UChar
   +0x1c8 Win32Thread      : Ptr64 Void
   +0x140 WaitBlockFill11  : [176] UChar
   +0x1f0 Ucb              : Ptr64 _UMS_CONTROL_BLOCK
   +0x1f8 Uch              : Ptr64 _KUMS_CONTEXT_HEADER
   +0x200 Spare21          : Ptr64 Void
   +0x208 QueueListEntry   : _LIST_ENTRY
   +0x218 NextProcessor    : Uint4B
   +0x218 NextProcessorNumber : Pos 0, 31 Bits
   +0x218 SharedReadyQueue : Pos 31, 1 Bit
   +0x21c QueuePriority    : Int4B
   +0x220 Process          : Ptr64 _KPROCESS
   +0x228 UserAffinity     : _GROUP_AFFINITY
   +0x228 UserAffinityFill : [10] UChar
   +0x232 PreviousMode     : Char
   +0x233 BasePriority     : Char
   +0x234 PriorityDecrement : Char
   +0x234 ForegroundBoost  : Pos 0, 4 Bits
   +0x234 UnusualBoost     : Pos 4, 4 Bits
   +0x235 Preempted        : UChar
   +0x236 AdjustReason     : UChar
   +0x237 AdjustIncrement  : Char
   +0x238 AffinityVersion  : Uint8B
   +0x240 Affinity         : _GROUP_AFFINITY
   +0x240 AffinityFill     : [10] UChar
   +0x24a ApcStateIndex    : UChar
   +0x24b WaitBlockCount   : UChar
   +0x24c IdealProcessor   : Uint4B
   +0x250 NpxState         : Uint8B
   +0x258 SavedApcState    : _KAPC_STATE
   +0x258 SavedApcStateFill : [43] UChar
   +0x283 WaitReason       : UChar
   +0x284 SuspendCount     : Char
   +0x285 Saturation       : Char
   +0x286 SListFaultCount  : Uint2B
   +0x288 SchedulerApc     : _KAPC
   +0x288 SchedulerApcFill0 : [1] UChar
   +0x289 ResourceIndex    : UChar
   +0x288 SchedulerApcFill1 : [3] UChar
   +0x28b QuantumReset     : UChar
   +0x288 SchedulerApcFill2 : [4] UChar
   +0x28c KernelTime       : Uint4B
   +0x288 SchedulerApcFill3 : [64] UChar
   +0x2c8 WaitPrcb         : Ptr64 _KPRCB
   +0x288 SchedulerApcFill4 : [72] UChar
   +0x2d0 LegoData         : Ptr64 Void
   +0x288 SchedulerApcFill5 : [83] UChar
   +0x2db CallbackNestingLevel : UChar
   +0x2dc UserTime         : Uint4B
   +0x2e0 SuspendEvent     : _KEVENT
   +0x2f8 ThreadListEntry  : _LIST_ENTRY
   +0x308 MutantListHead   : _LIST_ENTRY
   +0x318 AbEntrySummary   : UChar
   +0x319 AbWaitEntryCount : UChar
   +0x31a AbAllocationRegionCount : UChar
   +0x31b SystemPriority   : Char
   +0x31c SecureThreadCookie : Uint4B
   +0x320 LockEntries      : [6] _KLOCK_ENTRY
   +0x560 PropagateBoostsEntry : _SINGLE_LIST_ENTRY
   +0x568 IoSelfBoostsEntry : _SINGLE_LIST_ENTRY
   +0x570 PriorityFloorCounts : [16] UChar
   +0x580 PriorityFloorSummary : Uint4B
   +0x584 AbCompletedIoBoostCount : Int4B
   +0x588 AbCompletedIoQoSBoostCount : Int4B
   +0x58c KeReferenceCount : Int2B
   +0x58e AbOrphanedEntrySummary : UChar
   +0x58f AbOwnedEntryCount : UChar
   +0x590 ForegroundLossTime : Uint4B
   +0x598 GlobalForegroundListEntry : _LIST_ENTRY
   +0x598 ForegroundDpcStackListEntry : _SINGLE_LIST_ENTRY
   +0x5a0 InGlobalForegroundList : Uint8B
   +0x5a8 ReadOperationCount : Int8B
   +0x5b0 WriteOperationCount : Int8B
   +0x5b8 OtherOperationCount : Int8B
   +0x5c0 ReadTransferCount : Int8B
   +0x5c8 WriteTransferCount : Int8B
   +0x5d0 OtherTransferCount : Int8B
   +0x5d8 QueuedScb        : Ptr64 _KSCB
   +0x5e0 ThreadTimerDelay : Uint4B
   +0x5e4 ThreadFlags2     : Int4B
   +0x5e4 PpmPolicy        : Pos 0, 2 Bits
   +0x5e4 ThreadFlags2Reserved : Pos 2, 30 Bits
   +0x5e8 SchedulerAssist  : Ptr64 Void

```

엄청 많다. 패치가 되면서 구조체 오프셋도 모두 바뀌었다. 해당 정보를 찾아보니 윈도우 권한 상승 취약점과 연관된 게 나왔다. 현재 `0x098`의 멤버인 `ApcState(_KAPC_STATE)`를 이용하여 권한 토큰을 조작하는 것 같다.

이걸 찾아본건 x64에서 SSDT 구조가 좀 다르기 때문이었다.

# [+] x64 SSDT

`System Service Descriptor Table` 으로 `Dispatch Table`이라고도 되어있다. 특정 서비스 번호를 파라미터로 전달하여 호출할 때 해당 서비스 번호가 열거되어 있는 테이블이라고 보면 된다.

```
0:000> u ntdll!NtCreateFile
ntdll!NtCreateFile:
00007ffe`069db430 4c8bd1          mov     r10,rcx
00007ffe`069db433 b855000000      mov     eax,55h
00007ffe`069db438 f604250803fe7f01 test    byte ptr [SharedUserData+0x308 (00000000`7ffe0308)],1
00007ffe`069db440 7503            jne     ntdll!NtCreateFile+0x15 (00007ffe`069db445)
00007ffe`069db442 0f05            syscall
00007ffe`069db444 c3              ret
00007ffe`069db445 cd2e            int     2Eh
00007ffe`069db447 c3              ret
```

이 놈이 문제였는데... `syscall`을 할 때 0x55h 를 파라미터로 넘겨 호출한다.
내부적으로는 `nt!KiSystemCall64`를 호출하게 되고... `nt!NtCreateFile`을 호출한다. (ntdll! 이랑 nt!랑 다른줄 몰랐었음;)

현재 나는 Win10 1809(Build 17763.503)를 사용하고 있다. 물론 VM... 어쩃든 커널이 달라졌다.

SSDT를 찾기 위해 x64 관련된 후킹을 찾아봤다. x64에서는 SYSCALL을 사용하고, SYSCALL은,

> ring 0에서 OS 호출 핸들러를 호출한다. `IA32_LSTAR` MSR(Model Specific Register)에서 RIP를 가져와(RCX = RIP) 로드한다.  

라고 되어있다. 

기존에 `IA32_LSTAR` MSR은 `0xC0000082` 였다. 나도 그냥 블로그들을 보다가 따라갔더니 원래는 `KiSystemCall64`가 나와야 하는데... `KiSystemCall64Shadow`가 나왔다.

```
3: kd> rdmsr 0xC0000082
msr[c0000082] = fffff807`3d53f140
3: kd> u fffff807`3d53f140
nt!KiSystemCall64Shadow:
fffff807`3d53f140 0f01f8          swapgs
fffff807`3d53f143 654889242510700000 mov   qword ptr gs:[7010h],rsp
fffff807`3d53f14c 65488b242500700000 mov   rsp,qword ptr gs:[7000h]
fffff807`3d53f155 650fba24251870000001 bt  dword ptr gs:[7018h],1
fffff807`3d53f15f 7203            jb      nt!KiSystemCall64Shadow+0x24 (fffff807`3d53f164)
fffff807`3d53f161 0f22dc          mov     cr3,rsp
fffff807`3d53f164 65488b242508700000 mov   rsp,qword ptr gs:[7008h]
```

검색을 해보니 중국형아들이 친절하게 비슷한 얘기를 써놨다. 또한 이 함수로는 `KeServiceDescriptorTable`을 직접 검색할 수 없다라는 말도 써놨다.

일단 `zw` 함수를 확인한다.

```
3: kd> u nt!zwopenfile lB
nt!ZwOpenFile:
fffff807`3d3c0b40 488bc4          mov     rax,rsp
fffff807`3d3c0b43 fa              cli
fffff807`3d3c0b44 4883ec10        sub     rsp,10h
fffff807`3d3c0b48 50              push    rax
fffff807`3d3c0b49 9c              pushfq
fffff807`3d3c0b4a 6a10            push    10h
fffff807`3d3c0b4c 488d05ad700000  lea     rax,[nt!KiServiceLinkage (fffff807`3d3c7c00)]
fffff807`3d3c0b53 50              push    rax
fffff807`3d3c0b54 b833000000      mov     eax,33h
fffff807`3d3c0b59 e9e23f0100      jmp     nt!KiServiceInternal (fffff807`3d3d4b40)
fffff807`3d3c0b5e c3              ret
```

`KiServiceInternal`을 따라 들어간다.

```
nt!KiServiceInternal:
fffff807`3d3d4b40 4883ec08        sub     rsp,8
fffff807`3d3d4b44 55              push    rbp
fffff807`3d3d4b45 4881ec58010000  sub     rsp,158h
fffff807`3d3d4b4c 488dac2480000000 lea     rbp,[rsp+80h]
fffff807`3d3d4b54 48899dc0000000  mov     qword ptr [rbp+0C0h],rbx
fffff807`3d3d4b5b 4889bdc8000000  mov     qword ptr [rbp+0C8h],rdi
fffff807`3d3d4b62 4889b5d0000000  mov     qword ptr [rbp+0D0h],rsi
fffff807`3d3d4b69 fb              sti
fffff807`3d3d4b6a 65488b1c2588010000 mov   rbx,qword ptr gs:[188h]
fffff807`3d3d4b73 0f0d8b90000000  prefetchw [rbx+90h]
fffff807`3d3d4b7a 0fb6bb32020000  movzx   edi,byte ptr [rbx+232h]
fffff807`3d3d4b81 40887da8        mov     byte ptr [rbp-58h],dil
fffff807`3d3d4b85 c6833202000000  mov     byte ptr [rbx+232h],0
fffff807`3d3d4b8c 4c8b9390000000  mov     r10,qword ptr [rbx+90h]
fffff807`3d3d4b93 4c8995b8000000  mov     qword ptr [rbp+0B8h],r10
fffff807`3d3d4b9a 4c8d1d4f030000  lea     r11,[nt!KiSystemServiceStart (fffff807`3d3d4ef0)]
fffff807`3d3d4ba1 41ffe3          jmp     r11
```

다음은 `KiSystemServiceStart`

```
3: kd> u nt!KiSystemServiceStart l17
nt!KiSystemServiceStart:
fffff807`3d3d4ef0 4889a390000000  mov     qword ptr [rbx+90h],rsp
fffff807`3d3d4ef7 8bf8            mov     edi,eax
fffff807`3d3d4ef9 c1ef07          shr     edi,7
fffff807`3d3d4efc 83e720          and     edi,20h
fffff807`3d3d4eff 25ff0f0000      and     eax,0FFFh
nt!KiSystemServiceRepeat:
fffff807`3d3d4f04 4c8d1575693900  lea     r10,[nt!KeServiceDescriptorTable (fffff807`3d76b880)]
fffff807`3d3d4f0b 4c8d1d6eea3700  lea     r11,[nt!KeServiceDescriptorTableShadow (fffff807`3d753980)]
fffff807`3d3d4f12 f7437880000000  test    dword ptr [rbx+78h],80h
fffff807`3d3d4f19 7413            je      nt!KiSystemServiceRepeat+0x2a (fffff807`3d3d4f2e)
fffff807`3d3d4f1b f7437800002000  test    dword ptr [rbx+78h],200000h
fffff807`3d3d4f22 7407            je      nt!KiSystemServiceRepeat+0x27 (fffff807`3d3d4f2b)
fffff807`3d3d4f24 4c8d1dd5ea3700  lea     r11,[nt!KeServiceDescriptorTableFilter (fffff807`3d753a00)]
fffff807`3d3d4f2b 4d8bd3          mov     r10,r11
fffff807`3d3d4f2e 413b443a10      cmp     eax,dword ptr [r10+rdi+10h]
fffff807`3d3d4f33 0f832c050000    jae     nt!KiSystemServiceExitPico+0x160 (fffff807`3d3d5465)
fffff807`3d3d4f39 4d8b143a        mov     r10,qword ptr [r10+rdi]
fffff807`3d3d4f3d 4d631c82        movsxd  r11,dword ptr [r10+rax*4]
fffff807`3d3d4f41 498bc3          mov     rax,r11
fffff807`3d3d4f44 49c1fb04        sar     r11,4
fffff807`3d3d4f48 4d03d3          add     r10,r11
fffff807`3d3d4f4b 83ff20          cmp     edi,20h
fffff807`3d3d4f4e 7550            jne     nt!KiSystemServiceGdiTebAccess+0x49 (fffff807`3d3d4fa0)
fffff807`3d3d4f50 4c8b9bf0000000  mov     r11,qword ptr [rbx+0F0h]
```

중간에 `KiSystemServiceRepeat`를 확인하면 `KeServiceDescriptorTable`을 가져오는 것을 볼 수 있다.

```
3: kd> dq KeServiceDescriptorTable
fffff807`3d76b880  fffff807`3d60e2b0 00000000`00000000
fffff807`3d76b890  00000000`000001cf fffff807`3d60e9f0
fffff807`3d76b8a0  00000000`00000000 00000000`00000000
fffff807`3d76b8b0  00000000`00000000 00000000`00000000
fffff807`3d76b8c0  fffff807`3d53d280 fffff807`3d53d300
fffff807`3d76b8d0  fffff807`3d53dd00 fffff807`3d53dd80
fffff807`3d76b8e0  fffff807`3d53de00 fffff807`3d53f140
fffff807`3d76b8f0  fffff807`3d53ee00 00000000`00000000
```

가장 많이 당황한 부분이다. 중국 블로그를 보며 봤는데 번역이 이상하다보니... 현재 저 `KeServiceDescriptorTable`의 주소가 왜 저거냐를 설명하는 듯??;

공식을 얘기하며 `NewAddress - OldAddress - <command byte>` 를 이야기하는거 보면 점프 명령같은데 사용되는 상대주소공식을 말하는 것 같다. 

그래서... SSDT = `0xfffff807'3d3d4f04(KeServiceDescriptorTable 주소 가져오는 부분 주소)` + 7 +  x = `0xfffff807'3d76b880` 이라는 공식을 말한다. `x`는 바이트로 `0x396975‬`가 되겠다. 이게 오프셋이 된다는 거 같다.

어쨋든 기본 주소는 저렇게 되고.. 이제 저기서 서비스 테이블을 어떻게 찾을 수 있느냐인데...

여기도 공식이 나온다. 서비스 주소 = `ServiceTableBase[index] >> 4 + KeServiceDescriptorTable` 라는 공식이 나오는데 봐보자.  

```
3: kd> dd fffff807`3d60e2b0 l1cf
fffff807`3d60e2b0  fc290304 fc334200 01c83002 04557400
fffff807`3d60e2c0  02246800 fdb94800 01f73b05 019a9d06
```

특이한건 여기선 DWORD 사이즈로 보더라... 음.. 어쨋든 이제 공식대로 계산을 해본다.

`fc290304 >> 4 + 0xfffff8073d60e2b0=0xFFFFF8074D2372E0`

```
3: kd> u FFFFF8074D2372E0
fffff807`4d2372e0 ??              ???
                        ^ Memory access error in 'u FFFFF8074D2372E0'
```

ㅎㅎㅎㅎㅎㅎㅎㅎ;; 안보인다. 매우 심기가 불편했다. 기껏 따라했는데........... 그래서 다음 배열도 확인해보았다.

`fc334200 >> 4 + 0xfffff8073d60e2b0=0xFFFFF807'4D2416D0`

```
3: kd> u FFFFF8074D2416D0
fffff807`4d2416d0 ??              ???
                        ^ Memory access error in 'u FFFFF8074D2416D0'
```

역시나 뭐 아무것도 안보인다 ㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎ;
뭔가 값이 요상한것도 같고...해서 3개의 배열을 더 확인했다.(`1c83002, 4557400, 2246800`)

```
3: kd> u FFFFF8073D7D65B0
nt!NtAcceptConnectPort:
fffff807`3d7d65b0 4c8bdc          mov     r11,rsp
fffff807`3d7d65b3 53              push    rbx
fffff807`3d7d65b4 4883ec60        sub     rsp,60h
fffff807`3d7d65b8 65488b042588010000 mov   rax,qword ptr gs:[188h]
fffff807`3d7d65c1 66ff88e4010000  dec     word ptr [rax+1E4h]
fffff807`3d7d65c8 488b842498000000 mov     rax,qword ptr [rsp+98h]
fffff807`3d7d65d0 c644245801      mov     byte ptr [rsp+58h],1
fffff807`3d7d65d5 498943e8        mov     qword ptr [r11-18h],rax

3: kd> u FFFFF8073DA639F0
nt!NtMapUserPhysicalPagesScatter:
fffff807`3da639f0 48895c2420      mov     qword ptr [rsp+20h],rbx
fffff807`3da639f5 55              push    rbp
fffff807`3da639f6 56              push    rsi
fffff807`3da639f7 57              push    rdi
fffff807`3da639f8 4154            push    r12
fffff807`3da639fa 4155            push    r13
fffff807`3da639fc 4156            push    r14
fffff807`3da639fe 4157            push    r15

3: kd> u FFFFF8073D832930
nt!NtWaitForSingleObject:
fffff807`3d832930 4c8bdc          mov     r11,rsp
fffff807`3d832933 49895b08        mov     qword ptr [r11+8],rbx
fffff807`3d832937 49897310        mov     qword ptr [r11+10h],rsi
fffff807`3d83293b 4d894318        mov     qword ptr [r11+18h],r8
fffff807`3d83293f 57              push    rdi
fffff807`3d832940 4156            push    r14
fffff807`3d832942 4157            push    r15
fffff807`3d832944 4883ec50        sub     rsp,50h

```

오오... 신기하리만큼 계산한 값만큼 함수들이 보인다. 뭔가 여기가 맞는 것 같다. 근데 왜 앞에 2개의 인덱스는....

계산식을 잘 기억해놔보자... 중국인들 멋있다... 다만 10개정도 블로그를 봤는데 다 같은 내용이라...........;
SSDT 후킹 공부를 해보려다가 SSDT 찾는거부터 어려워서 여기까지 왔다. 좀 더 공부해봐야지

